# GetBaluster Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BalusterPattern..::..GetBaluster Method
BalusterPattern Class See Also
---
Gets information about the given baluster from the main baluster pattern.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public BalusterInfo GetBaluster(
	int index
)
```

Visual Basic
---
```text
Public Function GetBaluster ( _
	index As Integer _
) As BalusterInfo
```

Visual C++
---
```text
public:
BalusterInfo^ GetBaluster(
	int index
)
```

# ### Parameters
index
    Type: System..::..Int32 The baluster index.
# ### Return Value
The requested baluster or nullNothingnullptra null reference (Nothing in Visual Basic) if index is out of range.
# See Also
BalusterPattern Class
Autodesk.Revit.DB.Architecture Namespace